; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-3degree-100mindistance-2trucks-8packages-1027seed

(define (problem transport-three-cities-sequential-3nodes-1000size-3degree-100mindistance-2trucks-8packages-1027seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  package-7 - package
  package-8 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 715,420 -> 611,818
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 42)
  ; 611,818 -> 715,420
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 42)
  ; 894,654 -> 611,818
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 33)
  ; 611,818 -> 894,654
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 33)
  ; 894,654 -> 715,420
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 30)
  ; 715,420 -> 894,654
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 30)
  ; 2039,524 -> 2540,791
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 57)
  ; 2540,791 -> 2039,524
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 57)
  ; 2861,522 -> 2540,791
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 42)
  ; 2540,791 -> 2861,522
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 42)
  ; 1583,2927 -> 1052,2709
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 58)
  ; 1052,2709 -> 1583,2927
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 58)
  ; 1592,2811 -> 1052,2709
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 55)
  ; 1052,2709 -> 1592,2811
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 55)
  ; 1592,2811 -> 1583,2927
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 12)
  ; 1583,2927 -> 1592,2811
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 12)
  ; 894,654 <-> 2039,524
  (road city-1-loc-3 city-2-loc-2)
  (= (road-length city-1-loc-3 city-2-loc-2) 116)
  (road city-2-loc-2 city-1-loc-3)
  (= (road-length city-2-loc-2 city-1-loc-3) 116)
  (road city-1-loc-1 city-3-loc-2)
  (= (road-length city-1-loc-1 city-3-loc-2) 146)
  (road city-3-loc-2 city-1-loc-1)
  (= (road-length city-3-loc-2 city-1-loc-1) 146)
  (road city-2-loc-2 city-3-loc-1)
  (= (road-length city-2-loc-2 city-3-loc-1) 187)
  (road city-3-loc-1 city-2-loc-2)
  (= (road-length city-3-loc-1 city-2-loc-2) 187)
  (at package-1 city-3-loc-2)
  (at package-2 city-2-loc-3)
  (at package-3 city-2-loc-2)
  (at package-4 city-3-loc-1)
  (at package-5 city-2-loc-3)
  (at package-6 city-1-loc-3)
  (at package-7 city-1-loc-3)
  (at package-8 city-1-loc-3)
  (at truck-1 city-2-loc-3)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-1-loc-2)
  (at package-3 city-2-loc-3)
  (at package-4 city-1-loc-3)
  (at package-5 city-1-loc-3)
  (at package-6 city-1-loc-1)
  (at package-7 city-3-loc-2)
  (at package-8 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-1 city-2-loc-3 package-5 capacity-3 capacity-4)
   deleted: (at package-5 city-2-loc-3) (capacity truck-1 capacity-4)
   added: (in package-5 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 8
2. (pick-up truck-1 city-2-loc-3 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-2-loc-3) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 8
3. (drive truck-1 city-2-loc-3 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-3)
   added: (at truck-1 city-2-loc-1)
   goals met: 0 of 8
4. (drive truck-1 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 8
5. (drive truck-1 city-2-loc-2 city-3-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-3-loc-1)
   goals met: 0 of 8
6. (pick-up truck-1 city-3-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-3-loc-1) (capacity truck-1 capacity-2)
   added: (in package-4 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 8
7. (drive truck-1 city-3-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 8
8. (drive truck-1 city-2-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 8
9. (pick-up truck-1 city-1-loc-3 package-8 capacity-0 capacity-1)
   deleted: (at package-8 city-1-loc-3) (capacity truck-1 capacity-1)
   added: (in package-8 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 8
10. (drop truck-1 city-1-loc-3 package-5 capacity-0 capacity-1)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-0)
   added: (at package-5 city-1-loc-3) (capacity truck-1 capacity-1)
   goals met: 1 of 8
11. (pick-up truck-1 city-1-loc-3 package-7 capacity-0 capacity-1)
   deleted: (at package-7 city-1-loc-3) (capacity truck-1 capacity-1)
   added: (in package-7 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 8
12. (drop truck-1 city-1-loc-3 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-1-loc-3) (capacity truck-1 capacity-1)
   goals met: 2 of 8
13. (pick-up truck-1 city-1-loc-3 package-6 capacity-0 capacity-1)
   deleted: (at package-6 city-1-loc-3) (capacity truck-1 capacity-1)
   added: (in package-6 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 8
14. (drive truck-1 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-2)
   goals met: 2 of 8
15. (drop truck-1 city-1-loc-2 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-1-loc-2) (capacity truck-1 capacity-1)
   goals met: 3 of 8
16. (drive truck-1 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-1)
   goals met: 3 of 8
17. (drop truck-1 city-1-loc-1 package-6 capacity-1 capacity-2)
   deleted: (in package-6 truck-1) (capacity truck-1 capacity-1)
   added: (at package-6 city-1-loc-1) (capacity truck-1 capacity-2)
   goals met: 4 of 8
18. (drive truck-1 city-1-loc-1 city-3-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-3-loc-2)
   goals met: 4 of 8
19. (drop truck-1 city-3-loc-2 package-7 capacity-2 capacity-3)
   deleted: (in package-7 truck-1) (capacity truck-1 capacity-2)
   added: (at package-7 city-3-loc-2) (capacity truck-1 capacity-3)
   goals met: 5 of 8
20. (pick-up truck-1 city-3-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-3-loc-2) (capacity truck-1 capacity-3)
   added: (in package-1 truck-1) (capacity truck-1 capacity-2)
   goals met: 5 of 8
21. (drive truck-1 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-1 city-3-loc-2)
   added: (at truck-1 city-3-loc-1)
   goals met: 5 of 8
22. (drive truck-1 city-3-loc-1 city-2-loc-2)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-2-loc-2)
   goals met: 5 of 8
23. (drop truck-1 city-2-loc-2 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-2)
   added: (at package-1 city-2-loc-2) (capacity truck-1 capacity-3)
   goals met: 6 of 8
24. (pick-up truck-1 city-2-loc-2 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-2-loc-2) (capacity truck-1 capacity-3)
   added: (in package-3 truck-1) (capacity truck-1 capacity-2)
   goals met: 6 of 8
25. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 6 of 8
26. (drive truck-1 city-2-loc-1 city-2-loc-3)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-3)
   goals met: 6 of 8
27. (drop truck-1 city-2-loc-3 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-2)
   added: (at package-3 city-2-loc-3) (capacity truck-1 capacity-3)
   goals met: 7 of 8
28. (drop truck-1 city-2-loc-3 package-8 capacity-3 capacity-4)
   deleted: (in package-8 truck-1) (capacity truck-1 capacity-3)
   added: (at package-8 city-2-loc-3) (capacity truck-1 capacity-4)
   goals met: 8 of 8
